Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ64MC202.h
#define _IPC15_DMA5IP0_POSITION                  0x00000004
#define _IPC15_DMA5IP0_MASK                      0x00000010
#define _IPC15_DMA5IP0_LENGTH                    0x00000001

#define _IPC15_DMA5IP1_POSITION                  0x00000005
#define _IPC15_DMA5IP1_MASK                      0x00000020
#define _IPC15_DMA5IP1_LENGTH                    0x00000001

#define _IPC15_DMA5IP2_POSITION                  0x00000006
#define _IPC15_DMA5IP2_MASK                      0x00000040
#define _IPC15_DMA5IP2_LENGTH                    0x00000001

#define _IPC15_RTCIP0_POSITION                   0x00000008
#define _IPC15_RTCIP0_MASK                       0x00000100
#define _IPC15_RTCIP0_LENGTH                     0x00000001

#define _IPC15_RTCIP1_POSITION                   0x00000009
#define _IPC15_RTCIP1_MASK                       0x00000200
#define _IPC15_RTCIP1_LENGTH                     0x00000001

#define _IPC15_RTCIP2_POSITION                   0x0000000A
#define _IPC15_RTCIP2_MASK                       0x00000400
#define _IPC15_RTCIP2_LENGTH                     0x00000001

#define _IPC15_FLTA1IP0_POSITION                 0x0000000C
#define _IPC15_FLTA1IP0_MASK                     0x00001000
#define _IPC15_FLTA1IP0_LENGTH                   0x00000001

#define _IPC15_FLTA1IP1_POSITION                 0x0000000D
#define _IPC15_FLTA1IP1_MASK                     0x00002000
#define _IPC15_FLTA1IP1_LENGTH                   0x00000001

#define _IPC15_FLTA1IP2_POSITION                 0x0000000E
#define _IPC15_FLTA1IP2_MASK                     0x00004000
#define _IPC15_FLTA1IP2_LENGTH                   0x00000001

#define _IPC16_U1EIP_POSITION                    0x00000004
#define _IPC16_U1EIP_MASK                        0x00000070
#define _IPC16_U1EIP_LENGTH                      0x00000003

#define _IPC16_U2EIP_POSITION                    0x00000008
#define _IPC16_U2EIP_MASK                        0x00000700
#define _IPC16_U2EIP_LENGTH                      0x00000003

#define _IPC16_CRCIP_POSITION                    0x0000000C
#define _IPC16_CRCIP_MASK                        0x00007000
#define _IPC16_CRCIP_LENGTH                      0x00000003

#define _IPC16_U1EIP0_POSITION                   0x00000004
#define _IPC16_U1EIP0_MASK                       0x00000010
#define _IPC16_U1EIP0_LENGTH                     0x00000001

#define _IPC16_U1EIP1_POSITION                   0x00000005
#define _IPC16_U1EIP1_MASK                       0x00000020
#define _IPC16_U1EIP1_LENGTH                     0x00000001

#define _IPC16_U1EIP2_POSITION                   0x00000006
#define _IPC16_U1EIP2_MASK                       0x00000040
#define _IPC16_U1EIP2_LENGTH                     0x00000001

#define _IPC16_U2EIP0_POSITION                   0x00000008
#define _IPC16_U2EIP0_MASK                       0x00000100
#define _IPC16_U2EIP0_LENGTH                     0x00000001

#define _IPC16_U2EIP1_POSITION                   0x00000009
#define _IPC16_U2EIP1_MASK                       0x00000200
#define _IPC16_U2EIP1_LENGTH                     0x00000001

#define _IPC16_U2EIP2_POSITION                   0x0000000A
#define _IPC16_U2EIP2_MASK                       0x00000400
#define _IPC16_U2EIP2_LENGTH                     0x00000001

#define _IPC16_CRCIP0_POSITION                   0x0000000C
#define _IPC16_CRCIP0_MASK                       0x00001000
#define _IPC16_CRCIP0_LENGTH                     0x00000001

#define _IPC16_CRCIP1_POSITION                   0x0000000D
#define _IPC16_CRCIP1_MASK                       0x00002000
#define _IPC16_CRCIP1_LENGTH                     0x00000001

#define _IPC16_CRCIP2_POSITION                   0x0000000E
#define _IPC16_CRCIP2_MASK                       0x00004000
#define _IPC16_CRCIP2_LENGTH                     0x00000001

#define _IPC17_DMA6IP_POSITION                   0x00000000
#define _IPC17_DMA6IP_MASK                       0x00000007
#define _IPC17_DMA6IP_LENGTH                     0x00000003

#define _IPC17_DMA7IP_POSITION                   0x00000004
#define _IPC17_DMA7IP_MASK                       0x00000070
#define _IPC17_DMA7IP_LENGTH                     0x00000003

#define _IPC17_DMA6IP0_POSITION                  0x00000000
#define _IPC17_DMA6IP0_MASK                      0x00000001
#define _IPC17_DMA6IP0_LENGTH                    0x00000001

#define _IPC17_DMA6IP1_POSITION                  0x00000001
#define _IPC17_DMA6IP1_MASK                      0x00000002
#define _IPC17_DMA6IP1_LENGTH                    0x00000001

#define _IPC17_DMA6IP2_POSITION                  0x00000002
#define _IPC17_DMA6IP2_MASK                      0x00000004
#define _IPC17_DMA6IP2_LENGTH                    0x00000001

#define _IPC17_DMA7IP0_POSITION                  0x00000004
#define _IPC17_DMA7IP0_MASK                      0x00000010
#define _IPC17_DMA7IP0_LENGTH                    0x00000001

#define _IPC17_DMA7IP1_POSITION                  0x00000005
#define _IPC17_DMA7IP1_MASK                      0x00000020
#define _IPC17_DMA7IP1_LENGTH                    0x00000001

#define _IPC17_DMA7IP2_POSITION                  0x00000006
#define _IPC17_DMA7IP2_MASK                      0x00000040
#define _IPC17_DMA7IP2_LENGTH                    0x00000001

#define _IPC18_PWM2IP_POSITION                   0x00000004
#define _IPC18_PWM2IP_MASK                       0x00000070
#define _IPC18_PWM2IP_LENGTH                     0x00000003

#define _IPC18_FLTA2IP_POSITION                  0x00000008
#define _IPC18_FLTA2IP_MASK                      0x00000700
#define _IPC18_FLTA2IP_LENGTH                    0x00000003

#define _IPC18_QEI2IP_POSITION                   0x0000000C
#define _IPC18_QEI2IP_MASK                       0x00007000
#define _IPC18_QEI2IP_LENGTH                     0x00000003

#define _IPC18_PWM2IP0_POSITION                  0x00000004
#define _IPC18_PWM2IP0_MASK                      0x00000010
#define _IPC18_PWM2IP0_LENGTH                    0x00000001

#define _IPC18_PWM2IP1_POSITION                  0x00000005
#define _IPC18_PWM2IP1_MASK                      0x00000020
#define _IPC18_PWM2IP1_LENGTH                    0x00000001

#define _IPC18_PWM2IP2_POSITION                  0x00000006
#define _IPC18_PWM2IP2_MASK                      0x00000040
#define _IPC18_PWM2IP2_LENGTH                    0x00000001

#define _IPC18_FLTA2IP0_POSITION                 0x00000008
#define _IPC18_FLTA2IP0_MASK                     0x00000100
#define _IPC18_FLTA2IP0_LENGTH                   0x00000001

#define _IPC18_FLTA2IP1_POSITION                 0x00000009
#define _IPC18_FLTA2IP1_MASK                     0x00000200
#define _IPC18_FLTA2IP1_LENGTH                   0x00000001

